<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'إدارة الأدوار',
            'تعديل دور',
            'إدارة الطلاب',
            'عرض طالب',
            'إضافة طالب',
            'تعديل طالب',
            'حذف طالب',
            'إدارة متابعة الحفظ والمراجعة',
            'إدارة تقرير الحفظ والمراجعة',
            'إدارة التقارير الشهرية',
            'تصفير بيانات الحفظ والمراجعة',
            'إدارة المحفظين',
            'إضافة محفظ',
            'تعديل محفظ',
            'حذف محفظ',
            'إدارة حضور وغياب المحفظين',
            'إدارة مشرفي المراحل',
            'إضافة مشرف مرحلة',
            'تعديل مشرف مرحلة',
            'حذف مشرف مرحلة',
            'إدارة المجموعات',
            'إضافة مجموعة',
            'تعديل مجموعة',
            'سحب محفظ من مجموعة',
            'نقل مجموعة',
            'حذف مجموعة',
            'إدارة المراحل',
            'إضافة مرحلة',
            'تعديل مرحلة',
            'حذف مرحلة',
            'إدارة الإختبارات',
            'إضافة اختبار',
            'إعدادات الإختبارات',
            'إدارة اختبارات اليوم',
            'إدارة طلبات الإختبارات',
            'إجراء طلب اختبار',
            'إجراء الإختبار',
            'إدارة المختبرين',
            'إضافة مختبر',
            'حذف مختبر',
            'إدارة صندوق الشكاوي والإقتراحات',
            'تقديم شكوى/اقتراح',
            'إدارة أعضاء الرقابة',
            'إضافة مراقب',
            'إدارة أعضاء الأنشطة',
            'إضافة منشط',
            'إدارة أنواع الأنشطة',
            'إضافة نوع نشاط',
            'تعديل نوع نشاط',
            'إدارة الأنشطة',
            'إدارة طلبات الأنشطة',
            'إجراء طلب نشاط',
            'إدارة المستخدمين',
            'إضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',
            'إدارة الاجراءات العقابية',
            'إضافة اجراء عقابي',
            'تعديل اجراء عقابي',
            'حذف اجراء عقابي',
        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
