<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'إدارة الأدوار',
            'إضافة دور',
            'تعديل دور',
            'حذف دور',
            'إدارة الطلاب',
            'إضافة طالب',
            'تعديل طالب',
            'حذف طالب',
            'إدارة حضور وغياب الطلاب',
            'إدارة متابعة الحفظ والمراجعة',
            'إدارة تقرير الحفظ والمراجعة',
            'إدارة المحفظين',
            'إضافة محفظ',
            'تعديل محفظ',
            'حذف محفظ',
            'إدارة حضور وغياب المحفظين',
            'إدارة مشرفي المراحل',
            'إضافة مشرف مرحلة',
            'تعديل مشرف مرحلة',
            'حذف مشرف مرحلة',
            'إدارة الإداريين',
            'إضافة إداري',
            'تعديل إداري',
            'حذف إداري',
            'إدارة المجموعات',
            'إضافة مجموعة',
            'تعديل مجموعة',
            'نقل مجموعة',
            'حذف مجموعة',
            'إدارة المراحل',
            'إضافة مرحلة',
            'تعديل مرحلة',
            'حذف مرحلة',
            'إدارة الإختبارات',
            'إدارة اختبارات اليوم',
            'إجراء الإختبار',
            'إضافة اختبار',
            'تعديل اختبار',
            'حذف اختبار',
            'إعدادات الإختبارات',
            'إدارة طلبات الإختبارات',
            'إدارة طلبات اختبارات التجميعي',
            'إضافة اختبار تجميعي',
            'إدارة اختبارات التجميعي اليوم',
            'إجراء طلب اختبار',
            'إدارة المختبرين',
            'إضافة مختبر',
            'إدارة المستخدمين',
            'عرض مستخدم',
            'إضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',
        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
