<?php

namespace Database\Seeders;

use App\Models\QuranPart;
use Illuminate\Database\Seeder;

class QuranPartsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $quran_parts = [
            'الجزء الأول (الفاتحة)',
            'الجزء الثاني (البقرة)',
            'الجزء الثالث (البقرة)',
            'الجزء الرابع (آل عمران)',
            'الجزء الخامس (النساء)',
            'الجزء السادس (النساء)',
            'الجزء السابع (المائدة)',
            'الجزء الثامن (الأنعام)',
            'الجزء التاسع (الأعراف)',
            'الجزء العاشر (الأنفال)',
            'الجزء الحادي عشر (التوبة)',
            'الجزء الثاني عشر (هود)',
            'الجزء الثالث عشر (يوسف)',
            'الجزء الرابع عشر (الحجر)',
            'الجزء الخامس عشر (الإسراء)',
            'الجزء السادس عشر (الكهف)',
            'الجزء السابع عشر (الأنبياء)',
            'الجزء الثامن عشر (المؤمنون)',
            'الجزء التاسع عشر (الفرقان)',
            'الجزء العشرون (النمل)',
            'الجزء الحادي والعشرون (العنكبوت)',
            'الجزء الثاني والعشرون (الأحزاب)',
            'الجزء الثالث والعشرون (يس)',
            'الجزء الرابع والعشرون (الزمر)',
            'الجزء الخامس والعشرون (الشورى)',
            'الجزء السادس والعشرون (الأحقاف)',
            'الجزء السابع والعشرون (الذاريات)',
            'الجزء الثامن والعشرون (قد سمع)',
            'الجزء التاسع والعشرون (تبارك)',
            'الجزء الثلاثين (عم)',
        ];

        foreach ($quran_parts as $quran_part) {
            QuranPart::create(['name' => $quran_part]);
        }
    }
}
